# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

In [1]:
# Step 1. Import the necessary libraries
import pandas as pd
import numpy as np

In [7]:
# Step 2. Create 3 differents Series, each of length 100, as follows:
s1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
s2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
s3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

print(s1, s2, s3)

0     4
1     2
2     2
3     2
4     4
     ..
95    2
96    1
97    2
98    1
99    3
Length: 100, dtype: int64 0     1
1     2
2     2
3     2
4     1
     ..
95    2
96    3
97    1
98    3
99    3
Length: 100, dtype: int64 0     20899
1     15432
2     27818
3     24119
4     23535
      ...
95    29619
96    29401
97    25766
98    23908
99    14113
Length: 100, dtype: int64

In [8]:
#Step 3. Let's create a DataFrame by joinning the Series by column

df = pd.concat([s1, s2,s3], axis=1)
df.head()

   0  1      2
0  4  1  20899
1  2  2  15432
2  2  2  27818
3  2  2  24119
4  4  1  23535

In [9]:
# Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter
df.rename(columns= {0:'Bedrooms', 1:'Bathrooms', 2:'Price/SqMt'}, inplace=True)
df.head()

   Bedrooms  Bathrooms  Price/SqMt
0         4          1       20899
1         2          2       15432
2         2          2       27818
3         2          2       24119
4         4          1       23535

In [10]:
# Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'
# join concat the values
bigcolumn = pd.concat([s1, s2, s3], axis=0)

# it is still a Series, so we need to transform it to a DataFrame
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       4
1       2
2       2
3       2
4       4
..    ...
95  29619
96  29401
97  25766
98  23908
99  14113

[300 rows x 1 columns]

In [11]:
# Step 6. Oops, it seems it is going only until index 99. Is it true?
len(bigcolumn)

300

In [12]:
# Step 7. Reindex the DataFrame so it goes from 0 to 299
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn

         0
0        4
1        2
2        2
3        2
4        4
..     ...
295  29619
296  29401
297  25766
298  23908
299  14113

[300 rows x 1 columns]